branches/FFF/Documentation/Source/Bio_Editing.org
#+TITLE: Bios Editing in Zambia
#+EMAIL: NELA.Percy@gmail.com
#+AUTHOR: Percy
#+DATE: November 2011
#+DESCRIPTION: Zambia is a piece of Con Management Software.  This document is a "How To" guide assisting in the way of editing the Bios for the Zambia FFF-branch instance for your convention.  This is still a work in progress.
#+KEYWORDS: Zambia, Documentation, FFF branch
#+LANGUAGE: en

#+OPTIONS: \n:t ^:nil timestamp:nil creator:nil H:3 num:t @:t ::nil |:t -:t todo:nil tasks:nil tags:t <:t *:t author:t email:t skip:nil d:t f:t pri:t
#+LATEX_CLASS: koma-article
#+LaTeX_CLASS_OPTIONS: [tablesignature] 
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[scaled]{beraserif}
#+LATEX_HEADER: \usepackage[scaled]{berasans}
#+LATEX_HEADER: \usepackage[scaled]{beramono}
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \usepackage{subfig}
#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \lstnewenvironment{common-lispcode}
#+LaTeX_HEADER: {\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LATEX_HEADER: \usepackage{paralist}
#+LATEX_HEADER: \let\itemize\compactitem
#+LATEX_HEADER: \let\description\compactdesc
#+LATEX_HEADER: \let\enumerate\compactenum
#+LATEX_HEADER: \usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
#+LATEX_HEADER: \pagestyle{fancy}
#+LaTeX: \pagenumbering{roman}
#+LaTeX: \thispagestyle{fancy}
#+LaTeX: \renewcommand{\headrulewidth}{0pt}
#+LaTeX: \renewcommand{\footrulewidth}{1pt}
#+LaTeX: \lhead{}
#+LaTeX: \rhead{}
#+LaTeX: \chead{}
#+LaTeX: \lfoot{{{{{AUTHOR}}}} <{{{{EMAIL}}}}>}
#+LaTeX: \cfoot{}
#+LaTeX: \rfoot{\thepage}
#+LaTeX: \begin{abstract}
#+LaTeX: \vspace{5cm}
#+LaTeX: {\LARGE{\textbf{Abstract:\\}}}
{{{DESCRIPTION}}}
#+LaTeX: \end{abstract}
#+HTML:<h2>Abstract:<br></h2><p>{{{DESCRIPTION}}}</p>
#+LaTeX: \newpage
#+LaTeX: \renewcommand{\headrulewidth}{1pt}
#+LaTeX: \chead{{{{{TITLE}}}}}
#+LaTeX: \tableofcontents
#+LaTeX: \listoftables
#+LaTeX: \listoffigures
#+LaTeX: \newpage
#+LaTeX: \pagenumbering{arabic}
* Introduction

  The biographical information for your presenters is an important
  part of the convention experience that Zambia manages.  This is part
  of how people decide they want to attend your convention and part of
  what they might want to do when there.  From a presenter's point of
  view, the biographical information is a way to connect with their
  fan-base, and allow contact, give information, or arrange for
  continued interactions.  From a con manager's point of view,
  managing biographical information is fairly work-intensive, and one
  of the things that doesn't exactly scale.

  There are several pieces that make up the biographical information
  matrix within Zambia.  Few, any, or all of the elements can be
  chosen to be deployed and customized to the desire of your
  particular convention or set of conventions.  Currently the
  biographical information information is designed to be held in a
  shared database, outside of a specific convention, so that, while
  the information is available and editable within that convention,
  when the information is updated, it is updated across all the
  conventions served from the same server, and information is
  available across multiple convention instances.  Not all of the
  conventions will necessarily use all of the information.
* Biographical Information Matrix

  The biographical information Matrix is made up of three different
  values.  The types of biographical information, the status of a
  biographical element, and the language that that element is written
  in.
** Types

   The (extendable) types that are currently in use in Zambia are:
   + Web: The verbose biographical information, limited by variables
     in the db_name.php file, that is shared on your Zambia site, for
     all to browse to, often less limited than the published
     information.  Most HTML markup works with this type.
   + Book: The biographical information that is published in your
     convention book, handout, or other printed materials that is
     often more limited by space concerns, and publishing costs.
     These limits are set in the db_name.php file.  This will be
     published so markup and hypertext is discouraged.
   + URI: The set of Uniform Resource Identifiers (URLs, URNs, etc)
     that are available on your Zambia site, for people to follow.
     Most HTML markup works with this type.
   + Picture: This is a URI reference to either an outside (http)
     picture or, preferably, a copy of said picture residing on the
     serving machine (/path/to/picture), so if the original gets
     hacked, Zambia isn't compromised.
