branches/FFF/Documentation/Bio_Editing.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Bios Editing in Zambia</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="November 2011"/>
<meta name="author" content="Percy"/>
<meta name="description" content="Zambia is a piece of Con Management Software.  This document is a "How To" guide assisting in the way of editing the Bios for the Zambia FFF-branch instance for your convention.  This is still a work in progress."/>
<meta name="keywords" content="Zambia, Documentation, FFF branch"/>
<link rel="stylesheet" href="../webpages/Common.css" type="text/css"/>

</head>
<body>
<div id="content">

<h1 class="title">Bios Editing in Zambia</h1>

<p>Zambia is a piece of Con Management Software.  This document is a "How To" guide assisting in the way of editing the Bios for the Zambia FFF-branch instance for your convention.  This is still a work in progress.<br/>
<h2>Abstract:<br></h2><p>Zambia is a piece of Con Management Software.  This document is a "How To" guide assisting in the way of editing the Bios for the Zambia FFF-branch instance for your convention.  This is still a work in progress.</p>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction </a></li>
<li><a href="#sec-2">2 Biographical Information Matrix </a>
<ul>
<li><a href="#sec-2_1">2.1 Types </a></li>
<li><a href="#sec-2_2">2.2 States </a></li>
<li><a href="#sec-2_3">2.3 Languages </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Pages </a>
<ul>
<li><a href="#sec-3_1">3.1 StaffManageBios.php </a></li>
<li><a href="#sec-3_2">3.2 StaffEditBios.php </a></li>
<li><a href="#sec-3_3">3.3 StaffEditCreateParticipant.php </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction </h2>
<div class="outline-text-2" id="text-1">


<p><br/>
The biographical information for your presenters is an important<br/>
part of the convention experience that Zambia manages.  This is part<br/>
of how people decide they want to attend your convention and part of<br/>
what they might want to do when there.  From a presenter's point of<br/>
view, the biographical information is a way to connect with their<br/>
fan-base, and allow contact, give information, or arrange for<br/>
continued interactions.  From a con manager's point of view,<br/>
managing biographical information is fairly work-intensive, and one<br/>
of the things that doesn't exactly scale.<br/>
</p>
<p><br/>
There are several pieces that make up the biographical information<br/>
matrix within Zambia.  Few, any, or all of the elements can be<br/>
chosen to be deployed and customized to the desire of your<br/>
particular convention or set of conventions.  Currently the<br/>
biographical information information is designed to be held in a<br/>
shared database, outside of a specific convention, so that, while<br/>
the information is available and editable within that convention,<br/>
when the information is updated, it is updated across all the<br/>
conventions served from the same server, and information is<br/>
available across multiple convention instances.  Not all of the<br/>
conventions will necessarily use all of the information.<br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Biographical Information Matrix </h2>
<div class="outline-text-2" id="text-2">


<p><br/>
The biographical information Matrix is made up of three different<br/>
values.  The types of biographical information, the status of a<br/>
biographical element, and the language that that element is written<br/>
in.<br/>
</p>
</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Types </h3>
<div class="outline-text-3" id="text-2_1">


<p><br/>
The (extendable) types that are currently in use in Zambia are:<br/>
</p><ul>
<li>
Web: The verbose biographical information, limited by variables<br/>
in the db_name.php file, that is shared on your Zambia site, for<br/>
all to browse to, often less limited than the published<br/>
information.  Most HTML markup works with this type.<br/>
</li>
<li>
Book: The biographical information that is published in your<br/>
convention book, handout, or other printed materials that is<br/>
often more limited by space concerns, and publishing costs.<br/>
These limits are set in the db_name.php file.  This will be<br/>
published so markup and hypertext is discouraged.<br/>
</li>
<li>
URI: The set of Uniform Resource Identifiers (URLs, URNs, etc)<br/>
that are available on your Zambia site, for people to follow.<br/>
Most HTML markup works with this type.<br/>
</li>
<li>
Picture: This is a URI reference to either an outside (http)<br/>
picture or, preferably, a copy of said picture residing on the<br/>
serving machine (/path/to/picture), so if the original gets<br/>
hacked, Zambia isn't compromised.<br/>
</li>
</ul>

</div>

</div>
