branches/FFF/Documentation/PDF/Bio_Editing.tex
\documentclass[tablesignature]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Bios Editing in Zambia}
\author{Percy}
\date{November 2011}

\begin{document}

\maketitle

% Org-mode is exporting headings to 3 levels.

\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{1pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{{Percy} <{NELA.Percy@gmail.com}>}
\cfoot{}
\rfoot{\thepage}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}
Zambia is a piece of Con Management Software.  This document is a ``How To'' guide assisting in the way of editing the Bios for the Zambia FFF-branch instance for your convention.  This is still a work in progress.
\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\chead{{Bios Editing in Zambia}}
\tableofcontents
\listoftables
\listoffigures
\newpage
\pagenumbering{arabic}
\section{Introduction}
\label{sec-1}


  The biographical information for your presenters is an important
  part of the convention experience that Zambia manages.  This is part
  of how people decide they want to attend your convention and part of
  what they might want to do when there.  From a presenter's point of
  view, the biographical information is a way to connect with their
  fan-base, and allow contact, give information, or arrange for
  continued interactions.  From a con manager's point of view,
  managing biographical information is fairly work-intensive, and one
  of the things that doesn't exactly scale.

  There are several pieces that make up the biographical information
  matrix within Zambia.  Few, any, or all of the elements can be
  chosen to be deployed and customized to the desire of your
  particular convention or set of conventions.  Currently the
  biographical information information is designed to be held in a
  shared database, outside of a specific convention, so that, while
  the information is available and editable within that convention,
  when the information is updated, it is updated across all the
  conventions served from the same server, and information is
  available across multiple convention instances.  Not all of the
  conventions will necessarily use all of the information.
\section{Biographical Information Matrix}
\label{sec-2}


  The biographical information Matrix is made up of three different
  values.  The types of biographical information, the status of a
  biographical element, and the language that that element is written
  in.
\subsection{Types}
\label{sec-2_1}


   The (extendable) types that are currently in use in Zambia are:
\begin{itemize}
\item Web: The verbose biographical information, limited by variables
     in the db\_{}name.php file, that is shared on your Zambia site, for
     all to browse to, often less limited than the published
     information.  Most HTML markup works with this type.
\item Book: The biographical information that is published in your
     convention book, handout, or other printed materials that is
     often more limited by space concerns, and publishing costs.
     These limits are set in the db\_{}name.php file.  This will be
     published so markup and hypertext is discouraged.
\item URI: The set of Uniform Resource Identifiers (URLs, URNs, etc)
     that are available on your Zambia site, for people to follow.
     Most HTML markup works with this type.
\item Picture: This is a URI reference to either an outside (http)
     picture or, preferably, a copy of said picture residing on the
     serving machine (/path/to/picture), so if the original gets
     hacked, Zambia isn't compromised.
\end{itemize}
