branches/FFF/Documentation/Bio_Editing.html

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> States </h3>
<div class="outline-text-3" id="text-2_2">

<ul>
<li>
raw: This is the information provided by the presenter when they<br/>
are permitted to, within Zambia.  This might be as far as the<br/>
involvement with the biographical information that the Zambia<br/>
staff will have.  This allows for unknown people to put unknown<br/>
references and information on your web-site.  Beware.<br/>
</li>
<li>
edited: This is intended to be the mid-step, the negotiation<br/>
point between the people responsible for what is being published<br/>
in the literature and on the web, and the individual presenters,<br/>
it is presented to them, so dialogue can happen, and they can see<br/>
how it is to be presented, should it be approved.  This might be<br/>
as far as the involvement with the biographical information that<br/>
the Zambia staff will have.  Once in the edited mode it might be<br/>
considered published.<br/>
</li>
<li>
good: This is intended to be what is published.  Once the edited<br/>
matches the raw, it should be promoted to the good level, then if<br/>
changes to the raw show up, they can go back through the vetting<br/>
process and, once again, be promoted to good, and then available<br/>
for the various publishing media.<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> Languages </h3>
<div class="outline-text-3" id="text-2_3">


<p><br/>
The language field is designed to contain any of the various<br/>
language elements.  Currently en-us and fr-ca are the two expected<br/>
ones, as a hold-over from the original "secondary language" concept<br/>
of Zambia when it was used for a Canadian event.  Starting any<br/>
language will allow it to be flexible enough to have it show up in<br/>
the appropriate tables.  Just adding to the LANGUAGE_LIST searches<br/>
for each/all of the languages listed.  While this is a first step<br/>
in the internationalization of this software, expanding the rest,<br/>
along these lines is expected and planned for.  Each of the other<br/>
elements, the various verbiage on the pages, and in the reports<br/>
will pull from similar tables, able to be customized off of, or<br/>
feed concurrently, depending on the design the multiple languages<br/>
available.  All of the biographical information is designed to be<br/>
subsequently displayed, rather than switched on the<br/>
$_SESSION['language'] variable.<br/>
</p></div>
</div>

</div>
