branches/FFF/Documentation/PDF/Bio_Editing.tex
\subsection{States}
\label{sec-2_2}

\begin{itemize}
\item raw: This is the information provided by the presenter when they
     are permitted to, within Zambia.  This might be as far as the
     involvement with the biographical information that the Zambia
     staff will have.  This allows for unknown people to put unknown
     references and information on your web-site.  Beware.
\item edited: This is intended to be the mid-step, the negotiation
     point between the people responsible for what is being published
     in the literature and on the web, and the individual presenters,
     it is presented to them, so dialogue can happen, and they can see
     how it is to be presented, should it be approved.  This might be
     as far as the involvement with the biographical information that
     the Zambia staff will have.  Once in the edited mode it might be
     considered published.
\item good: This is intended to be what is published.  Once the edited
     matches the raw, it should be promoted to the good level, then if
     changes to the raw show up, they can go back through the vetting
     process and, once again, be promoted to good, and then available
     for the various publishing media.
\end{itemize}
\subsection{Languages}
\label{sec-2_3}


   The language field is designed to contain any of the various
   language elements.  Currently en-us and fr-ca are the two expected
   ones, as a hold-over from the original ``secondary language'' concept
   of Zambia when it was used for a Canadian event.  Starting any
   language will allow it to be flexible enough to have it show up in
   the appropriate tables.  Just adding to the LANGUAGE\_{}LIST searches
   for each/all of the languages listed.  While this is a first step
   in the internationalization of this software, expanding the rest,
   along these lines is expected and planned for.  Each of the other
   elements, the various verbiage on the pages, and in the reports
   will pull from similar tables, able to be customized off of, or
   feed concurrently, depending on the design the multiple languages
   available.  All of the biographical information is designed to be
   subsequently displayed, rather than switched on the
   \$\_{}SESSION['language'] variable.
