branches/FFF/Documentation/Source/Bio_Editing.org
** StaffManageBios.php
#+LaTeX: \label{StaffManageBios.php}
#+HTML: <A NAME="StaffManageBios.php" ID="StaffManageBios.php"></A>
#+HTML: <A HREF="../webpages/StaffManageBios.php">StaffManageBios.php</A>

   The starting point for managing the biographical information data.
   This is set to work with only those folks who will be published.
   This is all the presenters, and the any of the super-volunteers.
   They might not be chosen to be published, or they might be,
   depending on the choice of the convention, and the relative space
   in the various publications.

   The rows are organized around the states so that if there is
   missing raw, edited (if used), and good (if used) elements, they
   are reported first, then if the raw elements and the edited
   elements don't match (if used) or the edited elements and the good
   elements don't match (if used) they are reported next.  Then,
   lastly, if everything matches, that is reported last.  Hopefully,
   come publication time, and con-time, all the elements will be in
   the last row.

   The columns are a combination of the various languages available
   (somewhat useless if only one language is used, but there, as a
   place-holder) and the type of the element.

   To bring up the list of individuals in any particular category of
   missing, incorrect, or even correct information, simply click on
   the number of elements in the state you wish to work with.  In the
   example below, there are seven individuals who do not have an
   edited en-us web entry in the biographical information matrix.  By
   clicking on the "7" in that section of the table, you bring up the
   list of participants who's elements need editing.

   The table might resemble the following:
#+CAPTION: Staff - Manage Participant Biographies
#+LABEL: tbl:staffmanageparticipantbiographies
#+ATTR_LaTeX: longtable width=\textwidth align=|c|c|c|c|c|c|c|c|c|
#+ATTR_HTML: border="1" rules="all" frame="all"
|-----------------------------------+-----------+-----------+------------+------------+-----------+-----------+---------------+---------------|
| Count of the States of the bios   | en-us web | fr-ca web | en-us book | fr-ca book | en-us uri | fr-ca uri | en-us picture | fr-ca picture |
|-----------------------------------+-----------+-----------+------------+------------+-----------+-----------+---------------+---------------|
| Missing raw bio                   |           |           |          3 |          6 |        59 |        61 |            14 |            61 |
| Missing edited bio                |         7 |        16 |         21 |          5 |        48 |        61 |            14 |            61 |
| Missing good bio                  |        59 |        59 |         59 |         59 |        59 |        61 |            14 |            61 |
| Raw bio doesn't match edited bio  |        17 |        11 |         18 |         19 |         9 |           |               |               |
| Edited bio doesn't match good bio |        12 |         9 |         28 |         46 |         9 |           |               |               |
| All bios match                    |         5 |         3 |          4 |            |           |        61 |            47 |            61 |
|-----------------------------------+-----------+-----------+------------+------------+-----------+-----------+---------------+---------------|

   Once the particular subsection of the editing has been picked, you
   will be provided with a matrix of names in this category, so you
   might choose the one(s) to be edited.

   The three columns in this table are:
   + Participant: If the link that is this name is chosen from this
     column, you will be brought to the [[StaffEditBios.php]] page
     relevant to the participant chosen, for editing purposes.
   + Edit Full: If the link that is this name is chosen from this
     column, you will be brought to the [[StaffEditCreateParticipant.php]]
     page, in the mode of editing the participant chosen, in case that
     is necessary to find out more about who they are, or if there are
     any notes, or the like to assist you with the biographical
     information editing.
   + Currently being edited by: This shows you the individual who
     presumes that they are the one editing the particular
     information.  Please, do not choose to edit biographical
     information for someone who is locked by someone other than you.

   The table might resemble the following:
#+CAPTION: Staff - Manage Participant Biographies Subedit
#+LABEL: tbl:staffmanageparticipantbiographiessubedit
#+ATTR_LaTeX: longtable width=\textwidth align=|l|l|l|l|
#+ATTR_HTML: border="1" rules="all" frame="all"
|-------------+-------------+---------------------------|
| Participant | Edit Full   | Currently being edited by |
|-------------+-------------+---------------------------|
| Mr E.       | Mr E.       |                           |
| Joker       | Joker       | Str8mn                    |
| Batman      | Batman      | The Riddler               |
| The Riddler | The Riddler | Batman                    |
| Catwoman    | Catwoman    |                           |
| Cartman     | Cartman     |                           |
| Robin       | Robin       |                           |
|-------------+-------------+---------------------------|

   There is also the "return" link, just above the table, that brings
   you back to the [[tbl:staffmanageparticipantbiographies][Staff - Manage Participant Biographies]], in case you
   are done with this particular subset of individuals, and wish to
   deal with another.
