branches/FFF/Documentation/Bio_Editing.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Pages </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> StaffManageBios.php </h3>
<div class="outline-text-3" id="text-3_1">


<A NAME="StaffManageBios.php" ID="StaffManageBios.php"></A>
<A HREF="../webpages/StaffManageBios.php">StaffManageBios.php</A>

<p>
The starting point for managing the biographical information data.<br/>
This is set to work with only those folks who will be published.<br/>
This is all the presenters, and the any of the super-volunteers.<br/>
They might not be chosen to be published, or they might be,<br/>
depending on the choice of the convention, and the relative space<br/>
in the various publications.<br/>
</p>
<p><br/>
The rows are organized around the states so that if there is<br/>
missing raw, edited (if used), and good (if used) elements, they<br/>
are reported first, then if the raw elements and the edited<br/>
elements don't match (if used) or the edited elements and the good<br/>
elements don't match (if used) they are reported next.  Then,<br/>
lastly, if everything matches, that is reported last.  Hopefully,<br/>
come publication time, and con-time, all the elements will be in<br/>
the last row.<br/>
</p>
<p><br/>
The columns are a combination of the various languages available<br/>
(somewhat useless if only one language is used, but there, as a<br/>
place-holder) and the type of the element.<br/>
</p>
<p><br/>
To bring up the list of individuals in any particular category of<br/>
missing, incorrect, or even correct information, simply click on<br/>
the number of elements in the state you wish to work with.  In the<br/>
example below, there are seven individuals who do not have an<br/>
edited en-us web entry in the biographical information matrix.  By<br/>
clicking on the "7" in that section of the table, you bring up the<br/>
list of participants who's elements need editing.<br/>
</p>
<p><br/>
The table might resemble the following:<br/>
</p><TABLE  border="1" rules="all" frame="all">
<a name="tbl:staffmanageparticipantbiographies" id="tbl:staffmanageparticipantbiographies"></a>
<caption>Staff - Manage Participant Biographies</caption>
<colgroup><col align="left" /><col align="right" /><col align="right" /><col align="right" /><col align="right" /><col align="right" /><col align="right" /><col align="right" /><col align="right" />
</colgroup>
<thead>
<tr><th scope="col">Count of the States of the bios</th><th scope="col">en-us web</th><th scope="col">fr-ca web</th><th scope="col">en-us book</th><th scope="col">fr-ca book</th><th scope="col">en-us uri</th><th scope="col">fr-ca uri</th><th scope="col">en-us picture</th><th scope="col">fr-ca picture</th></tr>
</thead>
<tbody>
<tr><td>Missing raw bio</td><td></td><td></td><td>3</td><td>6</td><td>59</td><td>61</td><td>14</td><td>61</td></tr>
<tr><td>Missing edited bio</td><td>7</td><td>16</td><td>21</td><td>5</td><td>48</td><td>61</td><td>14</td><td>61</td></tr>
<tr><td>Missing good bio</td><td>59</td><td>59</td><td>59</td><td>59</td><td>59</td><td>61</td><td>14</td><td>61</td></tr>
<tr><td>Raw bio doesn't match edited bio</td><td>17</td><td>11</td><td>18</td><td>19</td><td>9</td><td></td><td></td><td></td></tr>
<tr><td>Edited bio doesn't match good bio</td><td>12</td><td>9</td><td>28</td><td>46</td><td>9</td><td></td><td></td><td></td></tr>
<tr><td>All bios match</td><td>5</td><td>3</td><td>4</td><td></td><td></td><td>61</td><td>47</td><td>61</td></tr>
</tbody>
</table>


<p><br/>
Once the particular subsection of the editing has been picked, you<br/>
will be provided with a matrix of names in this category, so you<br/>
might choose the one(s) to be edited.<br/>
</p>
<p><br/>
The three columns in this table are:<br/>
</p><ul>
<li>
Participant: If the link that is this name is chosen from this<br/>
column, you will be brought to the <a href="#StaffEditBios.php">StaffEditBios.php</a> page<br/>
relevant to the participant chosen, for editing purposes.<br/>
</li>
<li>
Edit Full: If the link that is this name is chosen from this<br/>
column, you will be brought to the <a href="#StaffEditCreateParticipant.php">StaffEditCreateParticipant.php</a><br/>
page, in the mode of editing the participant chosen, in case that<br/>
is necessary to find out more about who they are, or if there are<br/>
any notes, or the like to assist you with the biographical<br/>
information editing.<br/>
</li>
<li>
Currently being edited by: This shows you the individual who<br/>
presumes that they are the one editing the particular<br/>
information.  Please, do not choose to edit biographical<br/>
information for someone who is locked by someone other than you.<br/>

<p><br/>
</p></li>
</ul>

<p>The table might resemble the following:<br/>
</p><TABLE  border="1" rules="all" frame="all">
<a name="tbl:staffmanageparticipantbiographiessubedit" id="tbl:staffmanageparticipantbiographiessubedit"></a>
<caption>Staff - Manage Participant Biographies Subedit</caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Participant</th><th scope="col">Edit Full</th><th scope="col">Currently being edited by</th></tr>
</thead>
<tbody>
<tr><td>Mr E.</td><td>Mr E.</td><td></td></tr>
<tr><td>Joker</td><td>Joker</td><td>Str8mn</td></tr>
<tr><td>Batman</td><td>Batman</td><td>The Riddler</td></tr>
<tr><td>The Riddler</td><td>The Riddler</td><td>Batman</td></tr>
<tr><td>Catwoman</td><td>Catwoman</td><td></td></tr>
<tr><td>Cartman</td><td>Cartman</td><td></td></tr>
<tr><td>Robin</td><td>Robin</td><td></td></tr>
</tbody>
</table>


<p><br/>
There is also the "return" link, just above the table, that brings<br/>
you back to the <a href="#tbl:staffmanageparticipantbiographies">Staff - Manage Participant Biographies</a>, in case you<br/>
are done with this particular subset of individuals, and wish to<br/>
deal with another.<br/>
</p></div>

</div>
