branches/FFF/Documentation/Bio_Editing.html

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> StaffEditBios.php </h3>
<div class="outline-text-3" id="text-3_2">


<A NAME="StaffEditBios.php" ID="StaffEditBios.php"></A>
<A HREF="../webpages/StaffEditBios.php">StaffEditBios.php</A>

<p>
If the edited and/or good states are to be used, this page is where<br/>
an individual's information is edited.  If just the raw information<br/>
is used, there is no need to use this page.  Once this page is<br/>
opened for a participant, the editing individual's name will be<br/>
placed in the "Currently being edited by" column, so two people<br/>
don't try to edit the same bio information at the same time.  <br/>
</p>
<p><br/>
There are two links at the top of the page.  The first, being the<br/>
individuals name, will lead you to the<br/>
<a href="#StaffEditCreateParticipant.php">StaffEditCreateParticipant.php</a> page, in the mode of editing the<br/>
participant chosen, and the return link, which will bring you right<br/>
back to the table <a href="#tbl:staffmanageparticipantbiographiessubedit">Staff - Manage Participant Biographies Subedit</a> on<br/>
the <a href="#StaffManageBios.php">StaffManageBios.php</a> page.<br/>
</p>
<p><br/>
Of course, any of the "Save Whole Page" buttons will save the<br/>
current state of the entire page, and clear the "Currently being<br/>
edited by" flag.<br/>
</p>
<p><br/>
This design of this page has a series of elements, broken down<br/>
first by state element (raw, edited, good) state, then by language<br/>
(en-us, fr-ca), and then by the type (web, book, uri, picture)<br/>
allowing for the editing of the edited (if used) and good (if used)<br/>
information.  The raw information is there for reference and<br/>
copying purposes only and is not in a malleable state.<br/>
</p></div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> StaffEditCreateParticipant.php </h3>
<div class="outline-text-3" id="text-3_3">


<A NAME="StaffEditCreateParticipant.php" ID="StaffEditCreateParticipant.php"></A>
<A HREF="../webpages/StaffEditCreateParticipant.php?action=edit">StaffEditCreateParticipant.php</A>

<p>
While this page is of more general use (which is documented<br/>
elsewhere) if absolutely necessary, it can be used to modify the<br/>
raw biographical information. This is most useful should that be<br/>
the only state of the information chosen for this instance of<br/>
Zambia.  The raw state of all of the types (web, book, URI,<br/>
picture) and languages are available to be edited on this page.<br/>
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Percy
<a href="mailto:NELA.Percy@gmail.com">&lt;NELA.Percy@gmail.com&gt;</a>
</p>
</div>
</div>
</body>
</html>
