branches/FFF/Documentation/PDF/Bio_Editing.tex
\subsection{StaffEditBios.php}
\label{sec-3_2}

\label{StaffEditBios.php}

   If the edited and/or good states are to be used, this page is where
   an individual's information is edited.  If just the raw information
   is used, there is no need to use this page.  Once this page is
   opened for a participant, the editing individual's name will be
   placed in the ``Currently being edited by'' column, so two people
   don't try to edit the same bio information at the same time.  

   There are two links at the top of the page.  The first, being the
   individuals name, will lead you to the
   \hyperref[StaffEditCreateParticipant.php]{StaffEditCreateParticipant.php} page, in the mode of editing the
   participant chosen, and the return link, which will bring you right
   back to the table \hyperref[tbl:staffmanageparticipantbiographiessubedit]{Staff - Manage Participant Biographies Subedit} on
   the \hyperref[StaffManageBios.php]{StaffManageBios.php} page.

   Of course, any of the ``Save Whole Page'' buttons will save the
   current state of the entire page, and clear the ``Currently being
   edited by'' flag.

   This design of this page has a series of elements, broken down
   first by state element (raw, edited, good) state, then by language
   (en-us, fr-ca), and then by the type (web, book, uri, picture)
   allowing for the editing of the edited (if used) and good (if used)
   information.  The raw information is there for reference and
   copying purposes only and is not in a malleable state.
\subsection{StaffEditCreateParticipant.php}
\label{sec-3_3}

\label{StaffEditCreateParticipant.php}

   While this page is of more general use (which is documented
   elsewhere) if absolutely necessary, it can be used to modify the
   raw biographical information. This is most useful should that be
   the only state of the information chosen for this instance of
   Zambia.  The raw state of all of the types (web, book, URI,
   picture) and languages are available to be edited on this page.

\end{document}
